cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/fuse'
tap 'homebrew/versions'
tap 'caskroom/version'
tap 'caskroom/fonts'
tap 'homebrew/dupes'

brew 'node'
brew 'ruby'
brew 'mongodb'
brew 'redis'
brew 'zsh'
brew 'youtube-dl'
brew 'task'
brew 'coreutils'
brew 'elixir'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'ntfs-3g'
brew 'postgresql'
brew 'rust'
brew 'aria2'
brew 'proxychains-ng'
brew 'pv'
brew 'siege'
brew 'watchman'
brew 'nano' # up to date nano <3
brew 'diff-so-fancy'

cask 'google-chrome'
cask 'iterm-beta'
cask 'sublime-text3'
cask 'vlc'
cask 'flux'
cask 'disk-inventory-x'
cask 'github-desktop'
cask 'osxfuse'

cask 'firefox'
cask 'atom'
cask 'font-dejavu-sans'
cask 'font-roboto'
cask 'transmission'
cask 'horndis' #usb tethering

